[
  {
    "id": "chunk-0",
    "text": "JOHAN CILLIERS\nHEAD OF SEO | AI AUTOMATION & GPT WORKFLOW\nSYSTEMS | REMOTE DEPARTMENT LEADERSHIP\nPROFESSIONAL SUMMARY\nSELECTED IMPACT\nDigital growth leader with 11+ years building SEO functions and AI automation systems that increase output quality and\nexecution speed. Proven record leading distributed teams, building scalable technical SEO frameworks, and linking strategy\nto measurable outcomes (180% traffic growth, doubled conversion rates, 40% faster production). Strong technical depth\nacross Python, APIs, analytics, and modern SEO toolchains, with a focus on operationalizing AI safely through QA gates and\nrepeatable workflows.\n180% traffic growth and doubled conversion rates through integrated SEO and UX strategies\n40% faster production using GPT-powered workflows, reducing costs by 50",
    "meta": {
      "index": "0"
    }
  },
  {
    "id": "chunk-1",
    "text": "grated SEO and UX strategies\n40% faster production using GPT-powered workflows, reducing costs by 50%\n60% reduction in manual work via AI-assisted automation pipelines for SEO and reporting\n50% faster deployments leading technical strategy for 20+ responsive websites\nCORE SKILLS\nSEO Department Leadership • Technical SEO & Architecture • Content Strategy • CRO & Experimentation\nAI Integration & Automation • GPT Prompt Systems • Python & API Development • Analytics (GA4, GSC,\nLooker)\nTOOLS & TECHNOLOGIES\nSemrush • Ahrefs • Screaming Frog • Google Search Console • GA4 • Looker Studio • GTM OpenAI API • GPT\nModels • Python • JavaScript • SQL • WordPress • Git/GitHub • ClickUp • Slack\nSOUTH AFRICA (REMOTE) • +27 82 8475 680 • JOHANLCILLIERS@GMAIL.COM •\nLINKEDIN.COM/IN/JOHAN-CILLIERS\nHEAD OF DIG",
    "meta": {
      "index": "1"
    }
  },
  {
    "id": "chunk-2",
    "text": "A (REMOTE) • +27 82 8475 680 • JOHANLCILLIERS@GMAIL.COM •\nLINKEDIN.COM/IN/JOHAN-CILLIERS\nHEAD OF DIGITAL | FSE DIGITAL | REMOTE\nBuilt and led SEO and development departments from scratch, defining SOPs, hiring plans, performance\nstandards, and cross-team delivery cadence\nDesigned AI-assisted automation systems across content, CRO auditing, and reporting for improved\nscalability\nCreated AI content generation system with structured prompts, QA gates, and human-in-the-loop\nvalidation\nAutomated end-to-end reporting workflows, reducing manual task management and improving delivery\nvisibility\nJUL 2025 – PRESENT\nHEAD OF WEB DEVELOPMENT | THE BRAINS | LONDON, UK\nLed technical strategy for 20+ responsive websites, improving deployment speed by 50%\nIntroduced AI-assisted QA and automated checks, red",
    "meta": {
      "index": "2"
    }
  },
  {
    "id": "chunk-3",
    "text": "sive websites, improving deployment speed by 50%\nIntroduced AI-assisted QA and automated checks, reducing bug-fix time by nearly 50%\nManaged cross-functional teams using agile methodologies; architected scalable, secure solutions\nJAN 2025 – JUL 2025\nHEAD OF SEO | HERDL | REMOTE\nDeveloped data-driven SEO strategies across diverse enterprise client portfolio\nDeployed AI-assisted workflows for keyword clustering, content briefs, and optimization QA\nImproved qualified organic traffic through strategic initiatives and proactive algorithm adaptation\nJAN 2023 – JAN 2025\nAUTOMATION SPECIALIST & HEAD OF SEO | ETEACHER GROUP |\nREMOTE\nDesigned AI-assisted automation pipelines integrating CRM, analytics, and content datasets, reducing\nmanual workload by 60%\nBuilt scalable SEO automation for keyword cl",
    "meta": {
      "index": "3"
    }
  },
  {
    "id": "chunk-4",
    "text": ", and content datasets, reducing\nmanual workload by 60%\nBuilt scalable SEO automation for keyword clustering, content planning, and QA across multilingual\nbrands\nManaged cross-border remote teams, establishing delivery cadence and governance standards\nJAN 2021 – JAN 2023\nDIGITAL STRATEGIST | SUPER GROUP (SGHC) | SOUTH AFRICA\nManaged organic search strategy for major international clients across regulated markets\nAutomated financial and marketing reporting systems, improving workflow efficiency by 60%\nPerformed extensive technical SEO audits and optimization implementations at scale\nJUN 2014 – JAN 2021\nSELECTED PROJECTS\nGPT Workflow Automation System: Built GPT-driven workflows reducing production time by 40% and\ncosts by 50% using structured prompts, QA gates, and automation pipelines.\nAI-",
    "meta": {
      "index": "4"
    }
  },
  {
    "id": "chunk-5",
    "text": "ction time by 40% and\ncosts by 50% using structured prompts, QA gates, and automation pipelines.\nAI-Powered QA & Development Tools: Implemented automated testing and bug detection systems that\ncut fix times by 50% and improved release consistency.\nSEO Performance Reporting System: Created executive reporting layer connecting GA4 and GSC into\nrepeatable dashboards and decision-making workflows.\nCERTIFICATIONS (SELECTED)\nGoogle: GA4 IQ, Ads (Search, Display, Video, Performance Max), AI Essentials, Digital Marketing & E-\ncommerce\nMicrosoft Azure: AI Fundamentals, AI Engineer Associate\nIndustry: Kellogg Digital Marketing & AI, HubSpot SEO, HubSpot AI for Marketers\nSEO Specialized: Semrush AI Visibility Essentials, MarketMotive Advanced SEO\nLANGUAGES\nEnglish (Native), Afrikaans (Native)",
    "meta": {
      "index": "5"
    }
  },
  {
    "id": "chunk-6",
    "text": "ibility Essentials, MarketMotive Advanced SEO\nLANGUAGES\nEnglish (Native), Afrikaans (Native)",
    "meta": {
      "index": "6"
    }
  }
]